<!-- terraform-plan: aurora-mysql/aurora-test003 -->
### Plan: `aurora-mysql/aurora-test003`

<details><summary>Show plan output</summary>

```
03:23:23.431 STDOUT terraform: Acquiring state lock. This may take a few moments...
03:23:26.060 STDOUT terraform: module.aurora-test003.data.aws_ssm_parameter.vpc_id: Reading...
03:23:26.688 STDOUT terraform: module.aurora-test003.data.aws_ssm_parameter.vpc_id: Read complete after 1s [id=/shared/dev/vpc/vpc-id]
03:23:26.839 STDOUT terraform: Terraform used the selected providers to generate the following execution
03:23:26.839 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
03:23:26.839 STDOUT terraform:   + create
03:23:26.839 STDOUT terraform: Terraform will perform the following actions:
03:23:26.839 STDOUT terraform:   # module.aurora-test003.aws_rds_cluster.this will be created
03:23:26.839 STDOUT terraform:   + resource "aws_rds_cluster" "this" {
03:23:26.839 STDOUT terraform:       + allocated_storage                     = (known after apply)
03:23:26.840 STDOUT terraform:       + apply_immediately                     = (known after apply)
03:23:26.840 STDOUT terraform:       + arn                                   = (known after apply)
03:23:26.840 STDOUT terraform:       + availability_zones                    = (known after apply)
03:23:26.840 STDOUT terraform:       + backtrack_window                      = 0
03:23:26.840 STDOUT terraform:       + backup_retention_period               = 1
03:23:26.840 STDOUT terraform:       + ca_certificate_identifier             = (known after apply)
03:23:26.840 STDOUT terraform:       + ca_certificate_valid_till             = (known after apply)
03:23:26.840 STDOUT terraform:       + cluster_identifier                    = "aurora-test003"
03:23:26.840 STDOUT terraform:       + cluster_identifier_prefix             = (known after apply)
03:23:26.840 STDOUT terraform:       + cluster_members                       = (known after apply)
03:23:26.840 STDOUT terraform:       + cluster_resource_id                   = (known after apply)
03:23:26.840 STDOUT terraform:       + cluster_scalability_type              = (known after apply)
03:23:26.840 STDOUT terraform:       + copy_tags_to_snapshot                 = true
03:23:26.840 STDOUT terraform:       + database_insights_mode                = (known after apply)
03:23:26.841 STDOUT terraform:       + database_name                         = (known after apply)
03:23:26.841 STDOUT terraform:       + db_cluster_parameter_group_name       = "aurora-test003-cpg"
03:23:26.841 STDOUT terraform:       + db_subnet_group_name                  = "shared-dev-rds-db-subnet-group"
03:23:26.841 STDOUT terraform:       + db_system_id                          = (known after apply)
03:23:26.841 STDOUT terraform:       + delete_automated_backups              = true
03:23:26.841 STDOUT terraform:       + deletion_protection                   = false
03:23:26.841 STDOUT terraform:       + enable_global_write_forwarding        = false
03:23:26.841 STDOUT terraform:       + enable_http_endpoint                  = false
03:23:26.841 STDOUT terraform:       + enable_local_write_forwarding         = false
03:23:26.841 STDOUT terraform:       + endpoint                              = (known after apply)
03:23:26.841 STDOUT terraform:       + engine                                = "aurora-mysql"
03:23:26.841 STDOUT terraform:       + engine_lifecycle_support              = (known after apply)
03:23:26.841 STDOUT terraform:       + engine_mode                           = "provisioned"
03:23:26.841 STDOUT terraform:       + engine_version                        = "8.0.mysql_aurora.3.10.3"
03:23:26.841 STDOUT terraform:       + engine_version_actual                 = (known after apply)
03:23:26.841 STDOUT terraform:       + final_snapshot_identifier             = (known after apply)
03:23:26.841 STDOUT terraform:       + hosted_zone_id                        = (known after apply)
03:23:26.841 STDOUT terraform:       + iam_roles                             = (known after apply)
03:23:26.841 STDOUT terraform:       + id                                    = (known after apply)
03:23:26.841 STDOUT terraform:       + kms_key_id                            = (known after apply)
03:23:26.841 STDOUT terraform:       + manage_master_user_password           = true
03:23:26.842 STDOUT terraform:       + master_user_secret                    = (known after apply)
03:23:26.842 STDOUT terraform:       + master_user_secret_kms_key_id         = (known after apply)
03:23:26.842 STDOUT terraform:       + master_username                       = "admin"
03:23:26.842 STDOUT terraform:       + monitoring_interval                   = (known after apply)
03:23:26.842 STDOUT terraform:       + monitoring_role_arn                   = (known after apply)
03:23:26.842 STDOUT terraform:       + network_type                          = (known after apply)
03:23:26.842 STDOUT terraform:       + performance_insights_kms_key_id       = (known after apply)
03:23:26.842 STDOUT terraform:       + performance_insights_retention_period = (known after apply)
03:23:26.842 STDOUT terraform:       + port                                  = (known after apply)
03:23:26.842 STDOUT terraform:       + preferred_backup_window               = "18:00-19:00"
03:23:26.842 STDOUT terraform:       + preferred_maintenance_window          = "sun:19:00-sun:20:00"
03:23:26.842 STDOUT terraform:       + reader_endpoint                       = (known after apply)
03:23:26.842 STDOUT terraform:       + skip_final_snapshot                   = false
03:23:26.842 STDOUT terraform:       + storage_encrypted                     = true
03:23:26.842 STDOUT terraform:       + storage_type                          = (known after apply)
03:23:26.842 STDOUT terraform:       + tags                                  = {
03:23:26.842 STDOUT terraform:           + "Name" = "aurora-test003"
03:23:26.842 STDOUT terraform:         }
03:23:26.842 STDOUT terraform:       + tags_all                              = {
03:23:26.842 STDOUT terraform:           + "Environment" = "dev"
03:23:26.842 STDOUT terraform:           + "ManagedBy"   = "Terraform"
03:23:26.842 STDOUT terraform:           + "Name"        = "aurora-test003"
03:23:26.842 STDOUT terraform:         }
03:23:26.842 STDOUT terraform:       + vpc_security_group_ids                = (known after apply)
03:23:26.843 STDOUT terraform:     }
03:23:26.843 STDOUT terraform:   # module.aurora-test003.aws_rds_cluster_instance.this[0] will be created
03:23:26.843 STDOUT terraform:   + resource "aws_rds_cluster_instance" "this" {
03:23:26.843 STDOUT terraform:       + apply_immediately                     = (known after apply)
03:23:26.843 STDOUT terraform:       + arn                                   = (known after apply)
03:23:26.843 STDOUT terraform:       + auto_minor_version_upgrade            = true
03:23:26.843 STDOUT terraform:       + availability_zone                     = (known after apply)
03:23:26.843 STDOUT terraform:       + ca_cert_identifier                    = (known after apply)
03:23:26.843 STDOUT terraform:       + cluster_identifier                    = (known after apply)
03:23:26.843 STDOUT terraform:       + copy_tags_to_snapshot                 = false
03:23:26.843 STDOUT terraform:       + db_parameter_group_name               = (known after apply)
03:23:26.843 STDOUT terraform:       + db_subnet_group_name                  = (known after apply)
03:23:26.843 STDOUT terraform:       + dbi_resource_id                       = (known after apply)
03:23:26.843 STDOUT terraform:       + endpoint                              = (known after apply)
03:23:26.843 STDOUT terraform:       + engine                                = "aurora-mysql"
03:23:26.843 STDOUT terraform:       + engine_version                        = "8.0.mysql_aurora.3.10.3"
03:23:26.843 STDOUT terraform:       + engine_version_actual                 = (known after apply)
03:23:26.843 STDOUT terraform:       + force_destroy                         = false
03:23:26.843 STDOUT terraform:       + id                                    = (known after apply)
03:23:26.843 STDOUT terraform:       + identifier                            = "aurora-test003-0"
03:23:26.843 STDOUT terraform:       + identifier_prefix                     = (known after apply)
03:23:26.843 STDOUT terraform:       + instance_class                        = "db.t4g.medium"
03:23:26.844 STDOUT terraform:       + kms_key_id                            = (known after apply)
03:23:26.844 STDOUT terraform:       + monitoring_interval                   = 0
03:23:26.844 STDOUT terraform:       + monitoring_role_arn                   = (known after apply)
03:23:26.844 STDOUT terraform:       + network_type                          = (known after apply)
03:23:26.844 STDOUT terraform:       + performance_insights_enabled          = (known after apply)
03:23:26.844 STDOUT terraform:       + performance_insights_kms_key_id       = (known after apply)
03:23:26.844 STDOUT terraform:       + performance_insights_retention_period = (known after apply)
03:23:26.844 STDOUT terraform:       + port                                  = (known after apply)
03:23:26.844 STDOUT terraform:       + preferred_backup_window               = (known after apply)
03:23:26.844 STDOUT terraform:       + preferred_maintenance_window          = (known after apply)
03:23:26.844 STDOUT terraform:       + promotion_tier                        = 0
03:23:26.844 STDOUT terraform:       + publicly_accessible                   = (known after apply)
03:23:26.844 STDOUT terraform:       + storage_encrypted                     = (known after apply)
03:23:26.844 STDOUT terraform:       + tags                                  = {
03:23:26.844 STDOUT terraform:           + "Name" = "aurora-test003-0"
03:23:26.844 STDOUT terraform:         }
03:23:26.844 STDOUT terraform:       + tags_all                              = {
03:23:26.844 STDOUT terraform:           + "Environment" = "dev"
03:23:26.844 STDOUT terraform:           + "ManagedBy"   = "Terraform"
03:23:26.844 STDOUT terraform:           + "Name"        = "aurora-test003-0"
03:23:26.844 STDOUT terraform:         }
03:23:26.844 STDOUT terraform:       + writer                                = (known after apply)
03:23:26.844 STDOUT terraform:     }
03:23:26.844 STDOUT terraform:   # module.aurora-test003.aws_rds_cluster_parameter_group.this will be created
03:23:26.844 STDOUT terraform:   + resource "aws_rds_cluster_parameter_group" "this" {
03:23:26.844 STDOUT terraform:       + arn         = (known after apply)
03:23:26.844 STDOUT terraform:       + description = "Managed by Terraform"
03:23:26.844 STDOUT terraform:       + family      = "aurora-mysql8.0"
03:23:26.844 STDOUT terraform:       + id          = (known after apply)
03:23:26.844 STDOUT terraform:       + name        = "aurora-test003-cpg"
03:23:26.845 STDOUT terraform:       + name_prefix = (known after apply)
03:23:26.845 STDOUT terraform:       + tags        = {
03:23:26.845 STDOUT terraform:           + "Name" = "aurora-test003-cpg"
03:23:26.845 STDOUT terraform:         }
03:23:26.845 STDOUT terraform:       + tags_all    = {
03:23:26.845 STDOUT terraform:           + "Environment" = "dev"
03:23:26.845 STDOUT terraform:           + "ManagedBy"   = "Terraform"
03:23:26.845 STDOUT terraform:           + "Name"        = "aurora-test003-cpg"
03:23:26.845 STDOUT terraform:         }
03:23:26.845 STDOUT terraform:     }
03:23:26.845 STDOUT terraform:   # module.aurora-test003.aws_security_group.this will be created
03:23:26.845 STDOUT terraform:   + resource "aws_security_group" "this" {
03:23:26.845 STDOUT terraform:       + arn                    = (known after apply)
03:23:26.845 STDOUT terraform:       + description            = "Managed by Terraform"
03:23:26.845 STDOUT terraform:       + egress                 = [
03:23:26.845 STDOUT terraform:           + {
03:23:26.845 STDOUT terraform:               + cidr_blocks      = [
03:23:26.845 STDOUT terraform:                   + "0.0.0.0/0",
03:23:26.845 STDOUT terraform:                 ]
03:23:26.845 STDOUT terraform:               + from_port        = 0
03:23:26.845 STDOUT terraform:               + ipv6_cidr_blocks = []
03:23:26.845 STDOUT terraform:               + prefix_list_ids  = []
03:23:26.845 STDOUT terraform:               + protocol         = "-1"
03:23:26.845 STDOUT terraform:               + security_groups  = []
03:23:26.845 STDOUT terraform:               + self             = false
03:23:26.845 STDOUT terraform:               + to_port          = 0
03:23:26.845 STDOUT terraform:                 # (1 unchanged attribute hidden)
03:23:26.845 STDOUT terraform:             },
03:23:26.845 STDOUT terraform:         ]
03:23:26.845 STDOUT terraform:       + id                     = (known after apply)
03:23:26.845 STDOUT terraform:       + ingress                = (known after apply)
03:23:26.845 STDOUT terraform:       + name                   = (known after apply)
03:23:26.845 STDOUT terraform:       + name_prefix            = "aurora-test003-"
03:23:26.845 STDOUT terraform:       + owner_id               = (known after apply)
03:23:26.845 STDOUT terraform:       + revoke_rules_on_delete = false
03:23:26.845 STDOUT terraform:       + tags                   = {
03:23:26.845 STDOUT terraform:           + "Name" = "aurora-test003-sg"
03:23:26.845 STDOUT terraform:         }
03:23:26.845 STDOUT terraform:       + tags_all               = {
03:23:26.846 STDOUT terraform:           + "Environment" = "dev"
03:23:26.846 STDOUT terraform:           + "ManagedBy"   = "Terraform"
03:23:26.846 STDOUT terraform:           + "Name"        = "aurora-test003-sg"
03:23:26.846 STDOUT terraform:         }
03:23:26.846 STDOUT terraform:       + vpc_id                 = (sensitive value)
03:23:26.846 STDOUT terraform:     }
03:23:26.846 STDOUT terraform: Plan: 4 to add, 0 to change, 0 to destroy.
03:23:26.846 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
03:23:26.846 STDOUT terraform: Note: You didn't use the -out option to save this plan, so Terraform can't
03:23:26.846 STDOUT terraform: guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>